package real;

/**
 * @ClassName 数星星
 * @Description 给出一个m*n的只由01组成的矩阵，我们称包含：       1     111       1  这样的形状为星星（矩阵的四角为0、1均可），现在要从这个矩阵中选出一个矩形区域，要求这个矩形区域中至少有k个星星，问有多少个这样的矩形区域。（矩形区域即选取连续的若干行和连续的若干列所构成的交集区域）  输入 输入第一行包含三个整数n,m,k(1<=n,m<=500,1<=k<=m*n), n和m分别表示矩阵的行数和列数。  接下来有n行，每行包含一个长度为m的仅含01的字符串，描述这个矩阵。  输出 输出仅包含一个正整数，表示符合要求的矩形区域的数量。   样例输入 3 5 2 11100 11110 01100 样例输出 2  Hint 有选择1到4列和1到5列两种矩形区域的选择方式。
 * @Author cqutwangyu
 * @DateTime 2019/3/7 19:48
 * @GitHub https://github.com/cqutwangyu
 */
public class 数星星 {
}
